trade_exp/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНалогообложенияНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ПродажаОблагаетсяЕНВД</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаНеОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаНаЭкспорт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВводОСВЭксплуатацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентПоНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОблагаетсяНДСУПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4023d8d4-9e71-4a9b-b0b9-205c28e22f29">
    <name>ЭкспортСырьевыхТоваровУслуг</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="540bf057-2915-4a0d-8b55-1833fc259d70">
    <name>ЭкспортНесырьевыхТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/СтатусыВодителей/СтатусыВодителей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="80675a86-f1b3-42aa-bbed-b443ea3fba8a">
  <name>СтатусыВодителей</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="24cec108-8195-4aad-a265-e2495c813871">
    <name>Готов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="25759240-bbde-4bc4-8a69-610103245566">
    <name>ВРейсе</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="8b61fd48-1b3f-434a-9f2d-7e7107b62b28">
    <name>НеГотов</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="7423ebb7-3eff-4d31-ba72-320c2bd8592c">
    <name>Возвращается</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ВариантыОбеспечения/ВариантыОбеспечения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ВариантыОбеспечения</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues extendedConfigurationObject="9b0356bb-5966-4577-ab5a-bbc09ae9323b">
    <name>Отгрузить</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="865e7fe8-0ba5-430f-8819-98ee2644d5c5">
    <name>НеТребуется</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4ed96c3e-4885-4c35-b010-4d22e1d10826">
    <name>КОбеспечению</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="cd44cebd-862f-40b1-a297-247d05c45d2f">
    <name>СоСклада</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="970e966f-77d3-4ec1-9ca5-f2f5a2a8e2d1">
    <name>РезервироватьПоМереПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/ЗаказНаПеремещение/ЗаказНаПеремещение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаказНаПеремещение</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СпособДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЖелаемаяДатаПоступления</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозкиОписание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПеревозчикПартнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СкладПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВремяДоставкиПо</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ВремяДоставкиС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Time</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДлительностьПеремещения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ЗонаДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ОрганизацияПолучатель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Сделка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресДоставки</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ОсобыеУсловияПеревозки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформацияПоДоставке</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АдресДоставкиПеревозчика</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СкладОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИспользоватьДлительностьПеремещения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВариантПриемкиТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КроссДокинг</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a3381073-5582-489a-a1a1-7eb9f58b9962">
    <name>ВидПодтоварки</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ce1881e3-33c3-455b-a2f7-904ff52c40e9">
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="a888ff0f-d0cf-430c-9b2c-f656dd97abe1">
    <name>ПеремещениеПодДеятельность</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f496a8d2-84e4-4149-9aac-a69ee5866213">
    <name>СтатусОтображение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НачалоОтгрузки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ВариантОбеспечения</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Отменено</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОкончаниеПоступления</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <dateQualifiers>
            <dateFractions>Date</dateFractions>
          </dateQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ПричинаОтмены</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ae8a89a6-a700-43c0-8d85-d829fa605755">
      <name>КомментарийОтИнженера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>30</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="f7ea394b-98b7-4079-a983-86bd3d915143">
      <name>Обособленно</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/CommonModules/АльтерраОбщегоНазначенияКлиент/Module.bsl
Процедура НапечататьПакетНаПринтерСтар(Знач Объект, Знач ЭтаФорма, ИмяПринтера=Неопределено)  Экспорт
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПараметрКоманды= Новый Массив;
		ПараметрКоманды.Добавить(Объект.Ссылка);
		ПараметрыПечати= Новый Структура;
		ПараметрыПечати.Вставить("ВыводитьСкидки", ИСТИНА);
		ПараметрыПечати.Вставить("ИмяПринтера", ИмяПринтера);
		
		Если УправлениеПечатьюКлиент.ПроверитьДокументыПроведены(ПараметрКоманды) Тогда
			//Нет счетфактуры 		
			Если  ЭтаФорма.ТекстСчетФактура = "Оформить счет-фактуру" Тогда
				
				УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер(
				"Обработка.ПечатьФормДополнительно",
				"ПечатьТоварногоЧека",
				ПараметрКоманды,
				ПараметрыПечати);
				
				//Если комиссионный товар 2 экземпляра чека
				Если Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС") Тогда	
					УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер(
					"Обработка.ПечатьФормДополнительно",
					"ПечатьТоварногоЧека",
					ПараметрКоманды,
					ПараметрыПечати);
				КонецЕсли;
				
				УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер(
				"Обработка.ПечатьФормДополнительно",
				"ПечатьТНСекцииРеализацияНов",
				ПараметрКоманды,
				ПараметрыПечати);
				
				Если АльтерраОбщегоНазначения.ЕстьУслуги(Объект) Тогда
					УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер(
					"Обработка.ПечатьАктОбОказанииУслуг",
					"Акт",
					ПараметрКоманды,
					ПараметрыПечати);
				КонецЕсли
			Иначе
				//Есть счетфактуры 		
				УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер(
				"Обработка.ПечатьОбщихФорм",
				"УПД",
				ПараметрКоманды,
				ПараметрыПечати);
				
				//Если комиссионный товар 3 УПД
				Если Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС") Тогда	
					УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер(
					"Обработка.ПечатьОбщихФорм",
					"УПД",
					ПараметрКоманды,
					ПараметрыПечати);
					
					УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер(
					"Обработка.ПечатьОбщихФорм",
					"УПД",
					ПараметрКоманды,
					ПараметрыПечати);
					
				КонецЕсли;
				
				УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер(
				"Обработка.ПечатьФормДополнительно",
				"ПечатьТНСекцииРеализацияНов",
				ПараметрКоманды,
				ПараметрыПечати);
				
				Если АльтерраОбщегоНазначения.ЕстьУслуги(Объект) Тогда
					УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер(
					"Обработка.ПечатьАктОбОказанииУслуг",
					"Акт",
					ПараметрКоманды,
					ПараметрыПечати);
				КонецЕсли
				
			КонецЕсли;
		Иначе
			Сообщить("Перед печатью необходимо провести документы!");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура НапечататьПакетНаПринтер(Знач Объект, Знач ЭтаФорма, ИмяПринтера=Неопределено)  Экспорт
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		МассивОбъектов= Новый Массив;
		МассивОбъектов.Добавить(Объект.Ссылка);
		
		ТабличныеДокументы= Новый СписокЗначений;
		ПараметрКоманды= Новый Массив;
		ПараметрКоманды.Добавить(Объект.Ссылка);
		ПараметрыПечати= Новый Структура;
		ПараметрыПечати.Вставить("ВыводитьСкидки", ИСТИНА);
		ПараметрыПечати.Вставить("ИмяПринтера", ИмяПринтера);
		
		Если Объект.Проведен Тогда
			
			ТабличныйДокумент= АльтерраОбщегоНазначения.ВыполнитьКомандуПечатиВнешнейОбработки(МассивОбъектов, "Печать по секциям", "ПечатьТНСекции", ПараметрыПечати);
			ТабличныйДокумент.Напечатать();
			
			//Нет счетфактуры 	
			Если НЕ ЗначениеЗаполнено(АльтерраОбщегоНазначения.ПечататьУПД(Объект.Ссылка)) Тогда
				
				ТабличныйДокумент= АльтерраОбщегоНазначения.ВыполнитьКомандуПечатиВнешнейОбработки(МассивОбъектов, "Печатные формы реализации", "ТоварныйЧек", ПараметрыПечати);
				ТабличныйДокумент.Напечатать();
				
				
				//Если комиссионный товар 2 экземпляра чека
				Если Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС") Тогда	
					ТабличныйДокумент= АльтерраОбщегоНазначения.ВыполнитьКомандуПечатиВнешнейОбработки(МассивОбъектов, "Печатные формы реализации", "ТоварныйЧек", ПараметрыПечати);
					ТабличныйДокумент.Напечатать();
				КонецЕсли;
				
				Если АльтерраОбщегоНазначения.ЕстьУслуги(Объект) Тогда
					УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер(
					"Обработка.ПечатьАктОбОказанииУслуг",
					"Акт",
					ПараметрКоманды,
					ПараметрыПечати);
				КонецЕсли;
			Иначе
				//Есть счетфактуры 		
				ТабличныйДокумент= АльтерраОбщегоНазначения.ВыполнитьКомандуПечатиВнешнейОбработки(МассивОбъектов, "Печатные формы реализации", "УПД", ПараметрыПечати);
				ТабличныйДокумент.Напечатать();
				
				//Если комиссионный товар 3 УПД
				Если Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС") Тогда	
					ТабличныйДокумент= АльтерраОбщегоНазначения.ВыполнитьКомандуПечатиВнешнейОбработки(МассивОбъектов, "Печатные формы реализации", "УПД", ПараметрыПечати);
					ДобавитьПечатнуюФормуСписок(ТабличныеДокументы, ТабличныйДокумент, ИмяПринтера);
					
					ТабличныйДокумент= АльтерраОбщегоНазначения.ВыполнитьКомандуПечатиВнешнейОбработки(МассивОбъектов, "Печатные формы реализации", "УПД", ПараметрыПечати);
					ТабличныйДокумент.Напечатать();
				КонецЕсли;
				
				Если АльтерраОбщегоНазначения.ЕстьУслуги(Объект) Тогда
					УправлениеПечатьюКлиент.ВыполнитьКомандуПечатиНаПринтер(
					"Обработка.ПечатьАктОбОказанииУслуг",
					"Акт",
					ПараметрКоманды,
					ПараметрыПечати);
				КонецЕсли;
				
			КонецЕсли;
			
			//Печать инструкций
			Ссылка= Объект.Ссылка;
			Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.РеализацияТоваровУслуг") ИЛИ ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЧекККМ") ИЛИ ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
				мФайлов= АльтерраОбщегоНазначения.ПолучитьВыборкуФайловИзТовара(Ссылка);
				
				РаботаСФайламиКлиент.НапечататьФайлы(мФайлов);
			КонецЕсли;
		
		Иначе
			Сообщить("Перед печатью необходимо провести документы!");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПечатнуюФормуСписок(ТабличныеДокументы, Знач ТабличныйДокумент, Знач ИмяПринтера="")
	Если ТабличныйДокумент <> Неопределено Тогда
		ТабличныйДокумент.ИмяПринтера= ИмяПринтера;
		ТабличныйДокумент.АвтоМасштаб = Истина;
		
		ТабличныеДокументы.Добавить(ТабличныйДокумент);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаСканированияВодителя(ЭтаФорма, Штрихкод)  Экспорт
	Сотрудник = РСС_УправлениеОчередьюИСборкойЗаказов.ПоискСотрудникаПоШтрихкоду(Штрихкод);
	Если ЗначениеЗаполнено(Сотрудник) Тогда
		Если АльтерраОбщегоНазначения.ЭтоВодитель(Сотрудник) Тогда
			СтатусВодителя= АльтерраОбщегоНазначения.ПолучитьТекущийСтатусВодителя(Сотрудник);
			Если  СтатусВодителя = ПредопределенноеЗначение("Перечисление.СтатусыВодителей.Готов") Тогда
				Рейс= АльтерраОбщегоНазначения.ПолучитьПодготовленныйРейс(Сотрудник, ПредопределенноеЗначение("Перечисление.СтатусыРейсов.ДокументыНаПогрузкуГотовы"));
				Если Рейс = Неопределено Тогда
					ПоказатьПредупреждение(, "Нет подготовленных рейсов для водителя!", 10, "Сканирование водителей");
					Возврат;
				Иначе
					ОткрытьФорму("Документ.ЗаданиеНаПеревозкуРейс.ФормаОбъекта", Новый Структура("Ключ", Рейс), ЭтаФорма,,,,, РежимОткрытияОкнаФормы.Независимый);
					Возврат;
				КонецЕсли;
				
			ИначеЕсли  СтатусВодителя = ПредопределенноеЗначение("Перечисление.СтатусыВодителей.ВРейсе") Тогда
				Рейс= АльтерраОбщегоНазначения.ПолучитьПодготовленныйРейс(Сотрудник, ПредопределенноеЗначение("Перечисление.СтатусыРейсов.ТСВПути"));
				Если Рейс = Неопределено Тогда
					ПоказатьПредупреждение(, "По водителю нет рейсов в пути!", 10, "Сканирование водителей");
					Возврат;
				Иначе
					ОткрытьФорму("Документ.ЗаданиеНаПеревозкуРейс.ФормаОбъекта", Новый Структура("Ключ", Рейс), ЭтаФорма,,,,, РежимОткрытияОкнаФормы.Независимый);
					Возврат;
				КонецЕсли;
				
			Иначе
				Попытка
					АльтерраОбщегоНазначения.УстановитьСтатусГотовВодителю(Сотрудник);
					Если СтатусВодителя = ПредопределенноеЗначение("Перечисление.СтатусыВодителей.ВРейсе") Тогда
						ПоказатьПредупреждение(, "Зарегестрирован возврат из рейса."+Символы.ПС+"Водитель готов к работе!", 3, "Сканирование водителей");
					Иначе 
						ПоказатьПредупреждение(, "Водитель готов к работе!", 3, "Сканирование водителей");
					КонецЕсли;
					Возврат;
				Исключение
					ПоказатьПредупреждение(, "При сконировании возникла ошибка!", 10, "Сканирование водителей");
					Возврат;
				КонецПопытки;
			КонецЕсли;
		Иначе
			ПоказатьПредупреждение(, "Водитель не распознан!", 10, "Сканирование водителей");
			Возврат;
		КонецЕсли
	КонецЕсли
КонецПроцедуры

Процедура ОткрытьДокументПродажи(ДокументПродажи, ЭтаФорма)  Экспорт
	ПараметрыОткрытия= Новый Структура;
	ПараметрыОткрытия.Вставить("Ключ", ДокументПродажи);
	Если ТипЗнч(ДокументПродажи)  =  Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		ОткрытьФорму("Документ.РеализацияТоваровУслуг.ФормаОбъекта", ПараметрыОткрытия, ЭтаФорма, Истина);
	ИначеЕсли ТипЗнч(ДокументПродажи)  =  Тип("ДокументСсылка.ЗаказКлиента") Тогда
		ОткрытьФорму("Документ.ЗаказКлиента.ФормаОбъекта", ПараметрыОткрытия, ЭтаФорма, Истина);
	ИначеЕсли ТипЗнч(ДокументПродажи)  =  Тип("ДокументСсылка.ЧекККМ") Тогда
		ОткрытьФорму("Документ.ЧекККМ.ФормаОбъекта", ПараметрыОткрытия, ЭтаФорма, Истина);
	КонецЕсли;
КонецПроцедуры

Процедура ОткрытьДокументПоступления(ДокументОснование, ЭтаФорма)  Экспорт
	ПараметрыОткрытия= Новый Структура;
	ПараметрыОткрытия.Вставить("Ключ", ДокументОснование);
	Если ТипЗнч(ДокументОснование)  =  Тип("ДокументСсылка.ПриобретениеТоваровУслуг") Тогда
		ОткрытьФорму("Документ.ПриобретениеТоваровУслуг.ФормаОбъекта", ПараметрыОткрытия, ЭтаФорма, Истина);
	ИначеЕсли ТипЗнч(ДокументОснование)  =  Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		ОткрытьФорму("Документ.ЗаказПоставщику.ФормаОбъекта", ПараметрыОткрытия, ЭтаФорма, Истина);
	ИначеЕсли ТипЗнч(ДокументОснование)  =  Тип("ДокументСсылка.ЗаказНаПеремещение") Тогда
		ОткрытьФорму("Документ.ЗаказНаПеремещение.ФормаОбъекта", ПараметрыОткрытия, ЭтаФорма, Истина);
	ИначеЕсли ТипЗнч(ДокументОснование)  =  Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		ОткрытьФорму("Документ.ПеремещениеТоваров.ФормаОбъекта", ПараметрыОткрытия, ЭтаФорма, Истина);
	КонецЕсли;
КонецПроцедуры

Процедура ОткрытьДокумент(Ссылка, ЭтаФорма)  Экспорт
	ПараметрыФормы= Новый Структура("Ключ", Ссылка);
	ИмяДокумента= АльтерраОбщегоНазначения.ИмяОбъекта(ТипЗнч(Ссылка));
	ОткрытьФорму("Документ."+ИмяДокумента+".ФормаОбъекта",ПараметрыФормы,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.Независимый);	
КонецПроцедуры

Функция ЭтоШтрихкодКартыЛояльности(Штрихкод) Экспорт
	ДлинаШтрихкода = 5;
	Возврат СтрДлина(Штрихкод) <= 13 И (Лев(Штрихкод, ДлинаШтрихкода) = "21000" ИЛИ Лев(Штрихкод, ДлинаШтрихкода) = "22000" ИЛИ Лев(Штрихкод, ДлинаШтрихкода) = "23000" ИЛИ Лев(Штрихкод, ДлинаШтрихкода) = "24000" ИЛИ Лев(Штрихкод, ДлинаШтрихкода) = "25000" ИЛИ Лев(Штрихкод, ДлинаШтрихкода) = "31000");
КонецФункции

Функция ЕстьОбособленноеОбеспечение(Знач Товары) Экспорт
	Для Каждого стрТовар Из Товары Цикл
		Если стрТовар.ВариантОбеспечения = ПредопределенноеЗначение("Перечисление.ВариантыОбеспечения.КОбеспечению") Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

Функция JSON_В_Объект(СтрокаJSON) Экспорт	
	Если ПустаяСтрока(СтрокаJSON) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Чтение= Новый ЧтениеJSON();
	Чтение.УстановитьСтроку(СтрокаJSON);
	Результат= ПрочитатьJSON(Чтение);
	Чтение.Закрыть();	
	
	Возврат Результат;
КонецФункции

Процедура ЗаменитьВWord(Object, Знач СтрокаПоиска, Знач СтрокаЗамены) Экспорт
	
	СтрокаПоиска = "{" + СтрокаПоиска + "}";
	СтрокаЗамены = Строка(СтрокаЗамены);
	
	Object.Select();
	Selection = Object.Application.Selection;
	
	FindObject = Selection.Find;
	FindObject.ClearFormatting();
	Пока FindObject.Execute(СтрокаПоиска) Цикл
		Если ПустаяСтрока(СтрокаЗамены) Тогда
			Selection.Delete();
		ИначеЕсли ЭтоАдресВременногоХранилища(СтрокаЗамены) Тогда
			Selection.Delete();
			ВременныйКаталог = КаталогВременныхФайлов();
#Если ВебКлиент Тогда
			ИмяВременногоФайла = ВременныйКаталог + Строка(Новый УникальныйИдентификатор) + ".tmp";
#Иначе
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла("tmp");
#КонецЕсли
			
			ОписанияФайлов = Новый Массив;
			ОписанияФайлов.Добавить(Новый ОписаниеПередаваемогоФайла(ИмяВременногоФайла, СтрокаЗамены));
			Если ПолучитьФайлССервераАсинх(ОписанияФайлов,ВременныйКаталог) Тогда
				Selection.Range.InlineShapes.AddPicture(ИмяВременногоФайла);
			Иначе
				Selection.TypeText("");
			КонецЕсли;
		Иначе
			Selection.TypeText(СтрокаЗамены);
		КонецЕсли;
	КонецЦикла;
	
	Selection.Collapse();
	
КонецПроцедуры

Процедура ПолучитьФайлИзИнтернета(Адрес, ИмяФайла) Экспорт
	АдресСервера= СтрЗаменить(Адрес, "http://", "");
	АдресСервера= СтрЗаменить(АдресСервера, "https://", "");
	
	ssl = Новый ЗащищенноеСоединениеOpenSSL( неопределено, неопределено );	
	
	Соединение = Новый HTTPСоединение(АдресСервера, ,,,,, ssl);
	
	Запрос = Новый HTTPЗапрос();
	Ответ = Соединение.Получить(Запрос);
	
	Соединение.Получить(Запрос, ИмяФайла);
КонецПроцедуры

#Область ЧтениеЛоговПоКассе

Процедура ИзвлечьIDТранзакции(ДокументСсылка, ДатаДокумента, СуммаОплаты) Экспорт
	
	
	ПараметрыДокумента=АльтерраОбщегоНазначения.ПолучитьПараметрыДокумента(ДокументСсылка);
 
	КоличествоОплат = ПараметрыДокумента.КоличествоОплат; 
	Для Счетчик = 0 по КоличествоОплат - 1 Цикл
		ДатаДокумента = ПараметрыДокумента.ДатаДокумента;
	    КодАвторизации = ПараметрыДокумента.КодАвторизации[Счетчик]; 
		СуммаДокумента = ПараметрыДокумента.СуммаДокумента[Счетчик];  
		
		IDТранзакции = НайтиIDТранзакции(ДатаДокумента, КодАвторизации, СуммаДокумента, ДокументСсылка);
		Если IDТранзакции <> "" Тогда
			АльтерраОбщегоНазначения.ЗаписьIDТранзакцииВРегистр(ДокументСсылка, IDТранзакции);
		КонецЕсли;
	КонецЦикла; 
	
КонецПроцедуры

Функция НайтиIDТранзакции(ДатаДокумента, КодАвторизации, СуммаОплаты, ДокументСсылка)
	
	//Сбербанк
	РасположениеЛогов = "C:\SC552";
	ФайлЛога = НайтиФайлы(РасположениеЛогов, "e.*");
	Если ФайлЛога.Количество()>0 Тогда 
		ПолноеИмяФайла=ФайлЛога[0].ПолноеИмя;
		ТекстЛога = Новый ЧтениеТекста(ПолноеИмяФайла,"cp866");
		ТекстФайла=ТекстЛога.Прочитать(); 
		СтрИДТранзакции = СтрПолучитьСтроку(ТекстФайла,20);
		Возврат СтрИДТранзакции;
	КонецЕсли;
	
	//ВТБ
	РасположениеЛогов = "c:\Arcus2\Logs";
	//отбираем файлы за текущий день и забираем последний из них
	НомерДокумента = Строка(Формат(ДатаДокумента, "ДФ=yyMMdd"));
	СтрокаПоиска = ""+НомерДокумента+"*.log";
	МассивЛогов = НайтиФайлы(РасположениеЛогов, СтрокаПоиска);
	ПолноеИмяФайла = "";
	
	Для каждого стрФайл из МассивЛогов Цикл
		ПолноеИмяФайла=стрФайл.ПолноеИмя;
		//читаем найденный файл, получаем из него ID транзакции
		ТекстЛога = Новый ЧтениеТекста(ПолноеИмяФайла);
		ТекстФайла=ТекстЛога.Прочитать();
		СтрокаПоиска = "Код авторизации:";
		СтрКодАвторизации=СОКРЛП(Сред(ТекстФайла,стрнайти(ТекстФайла,СтрокаПоиска)+16,6));
		СтрСуммаНачало=СтрНайти(ТекстФайла,"PRINT:СУММА:")+11;
		СтрСуммаКонец=СтрНайти(ТекстФайла,"RUB")-1;
		СтрСумма1 = СокрЛП(Лев(ТекстФайла,СтрСуммаНачало));
		СтрСумма2 = СокрЛП(Лев(ТекстФайла,СтрСуммаКонец));
		ДлинаСуммы = СтрДлина(СтрСумма2)-СтрДлина(СтрСумма1);
		
		СуммаСтрока = СокрЛП(Прав(СтрСумма2, ДлинаСуммы));
		Если ЭтоЧисло(СуммаСтрока) Тогда 
			Сумма = ?(ПустаяСтрока(СуммаСтрока),0,Число(СуммаСтрока));
		Иначе
			Сумма = 0;
		КонецЕсли; 
		
		
		Если СтрКодАвторизации<>КодАвторизации ИЛИ Сумма<>СуммаОплаты Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаПоиска = "PRINT:ID транзакции:";
		СтрАнализа=СОКРЛП(Сред(ТекстФайла,СтрНайти(ТекстФайла,СтрокаПоиска)+20,50));
		КонецСтроки=СтрНайти(СтрАнализа,Символы.ПС)-1;
		СтрИДТранзакции=Лев(СтрАнализа,КонецСтроки);
		
		Возврат СтрИДТранзакции;
	КонецЦикла; 
	
	//Инпас
	РасположениеЛогов = "C:\Program Files (x86)\INPAS\DualConnector";
	//отбираем файлы за текущий день и забираем последний из них 
	НомерДокумента = Строка(Формат(ДатаДокумента, "ДФ=yyyyMMdd"));
	СтрокаПоиска = "DualConnector" + НомерДокумента +".log";
	МассивЛогов = НайтиФайлы(РасположениеЛогов, СтрокаПоиска);
	ПолноеИмяФайла = "";
	Если МассивЛогов.Количество() = 0 Тогда
		Возврат "Не найден лог";
	КонецЕсли;
	
	Для каждого стрФайл из МассивЛогов Цикл     
		ПолноеИмяФайла=стрФайл.ПолноеИмя;
		//читаем найденный файл, получаем из него ID транзакции
		ТекстЛога = Новый ЧтениеТекста(ПолноеИмяФайла);
		ТекстФайла=ТекстЛога.Прочитать();
		
		ВхождениеСтроки = 1; 
		НачальнаяПозиция = 1; 
		Пока ВхождениеСтроки > 0 Цикл  
			ВхождениеСтроки = СтрНайти(ТекстФайла, "ID ТРАНЗАКЦИИ",,НачальнаяПозиция); 	
			Если ВхождениеСтроки > 0 Тогда 	
				ВременнаяСтрока=СОКРЛП(Сред(ТекстФайла,ВхождениеСтроки+21,35));
				НачальнаяПозиция = ВхождениеСтроки + 20; 
				ИдТранзакции = Лев(ВременнаяСтрока, 11); 
				КодАвторизацииИзЛога = СОКРЛП(Сред(ВременнаяСтрока, СтрНайти(ВременнаяСтрока, "КОД АВТОРИЗАЦИИ") + 16, 6)); 
				Если КодАвторизацииИзЛога = КодАвторизации Тогда 				
					Возврат ИдТранзакции;  
				КонецЕсли;
			КонецЕсли; 
		КонецЦикла; 
		
	КонецЦикла;
	
	
	Возврат "ID not found";
	
КонецФункции

#КонецОбласти

Функция ПолучитьIP() Экспорт
	
	IpАдрес = Неопределено;
	COMОбъект = ПолучитьCOMОбъект("winmgmts:\\.\root\CIMV2");	
	
	Результат = COMОбъект.ExecQuery("SELECT * FROM 
									|Win32_NetworkAdapterConfiguration 
									|WHERE IPEnabled = TRUE");
		
	Для Каждого Строка Из Результат Цикл	
		Для Каждого ПодСтрока Из Строка.IPAddress Цикл
			IpАдрес = ПодСтрока;
			Возврат IpАдрес;
		КонецЦикла;	
	КонецЦикла; 
	
КонецФункции

// Проверяет, приводима ли данная строка к числу.
//
// Параметры:
//  Значение         - Строка - проверяемая строка.
//
// Возвращаемое значение:
//   Булево - Истина - строка приводима к числу, Ложь - строка не приводима к числу.
//
Функция ЭтоЧисло(Знач Значение) Экспорт
	
	Если ТипЗнч(Значение) <> Тип("Строка") Тогда
		Возврат Ложь;
	КонецЕсли;
		
	Если СтрДлина(Значение) = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Если содержит только цифры и точку, то в результате замен должна быть получена пустая строка.
	// Проверять при помощи ПустаяСтрока нельзя, так как в исходной строке могут быть пробельные символы.
	Возврат СтрДлина(
		СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить(
		СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( СтрЗаменить( 
			Значение, "0", ""), "1", ""), "2", ""), "3", ""), "4", ""), "5", ""), "6", ""), "7", ""), "8", ""), "9", ""), ".", "")) = 0;
	
КонецФункции

#Область АвтоопределениеДистрибуция 

Функция ПолучитьТранспортныеИтог(Объект) Экспорт 
	
    Услуга =  АльтерраОбщегоНазначения.УслугаДоставкиСНДС();	
	СтрокиТовара = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", Услуга));
	
	Если СтрокиТовара.Количество() > 0 Тогда
	 	СтоимостьДоставки = СтрокиТовара[0].Количество;
	Иначе
		СтоимостьДоставки = 0;
	КонецЕсли;
	
	СумммаРасчетная = 0;
	СуммаКомпенсации = 0;
	
	Для Каждого Стр Из Объект.Товары Цикл
		СумммаРасчетная = СумммаРасчетная + Стр.Цена*Стр.Количество; 
        СуммаКомпенсации = СуммаКомпенсации + Окр(Стр.Цена*Стр.Количество*Стр.Компенсация/100,2);
	КонецЦикла;
	
	ТранспортныеИтог = (СтоимостьДоставки-СуммаКомпенсации)/(СумммаРасчетная - СуммаКомпенсации); //Объект.Товары.Итог("Компенсация"));
	
   Возврат ТранспортныеИтог; 
   
КонецФункции 

Процедура СнятьРаспределениеТранспортныхДистрибуция(Объект)  Экспорт  
	
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Объект);	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуРучнойСкидки");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ОчиститьАвтоматическуюСкидку"); 
	
		Для Каждого Строка из Объект.Товары Цикл
			Строка.ПроцентРучнойСкидки = Строка.ПроцентРучнойСкидки - Строка.Компенсация;
			Строка.Компенсация = 0; 
			Строка.СуммаРТ = 0;
			Строка.Распределять = Ложь;
			ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(Строка, СтруктураДействий, Неопределено);
		КонецЦикла;	 
КонецПроцедуры

Процедура ПересчитатьЦенуСДоставкойПечатьПоСтроке(Стр)  Экспорт
	
	Стр.ЦенаСДоставкойПечать =(Стр.Сумма + Стр.СуммаРТ)/Стр.КоличествоУпаковок;
	Стр.ПроцентТранспортных = (Стр.ЦенаСДоставкойПечать - Стр.Цена) / Стр.ЦенаСДоставкойПечать;
	
КонецПроцедуры

#КонецОбласти
